MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4331/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF4331_H_
#define _PIC18LF4331_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18LF4331
 */
#ifndef _XC_H_
#warning Header file pic18lf4331.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: DFLTCON
#define DFLTCON DFLTCON
extern volatile unsigned char           DFLTCON             __at(0xF60);
#ifndef _LIB_BUILD
asm("DFLTCON equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLTCK                  :3;
        unsigned FLT1EN                 :1;
        unsigned FLT2EN                 :1;
        unsigned FLT3EN                 :1;
        unsigned FLT4EN                 :1;
    };
    struct {
        unsigned FLTCK0                 :1;
        unsigned FLTCK1                 :1;
        unsigned FLTCK2                 :1;
    };
} DFLTCONbits_t;
extern volatile DFLTCONbits_t DFLTCONbits __at(0xF60);
// bitfield macros
#define _DFLTCON_FLTCK_POSN                                 0x0
#define _DFLTCON_FLTCK_POSITION                             0x0
#define _DFLTCON_FLTCK_SIZE                                 0x3
#define _DFLTCON_FLTCK_LENGTH                               0x3
#define _DFLTCON_FLTCK_MASK                                 0x7
#define _DFLTCON_FLT1EN_POSN                                0x3
#define _DFLTCON_FLT1EN_POSITION                            0x3
#define _DFLTCON_FLT1EN_SIZE                                0x1
#define _DFLTCON_FLT1EN_LENGTH                              0x1
#define _DFLTCON_FLT1EN_MASK                                0x8
#define _DFLTCON_FLT2EN_POSN                                0x4
#define _DFLTCON_FLT2EN_POSITION                            0x4
#define _DFLTCON_FLT2EN_SIZE                                0x1
#define _DFLTCON_FLT2EN_LENGTH                              0x1
#define _DFLTCON_FLT2EN_MASK                                0x10
#define _DFLTCON_FLT3EN_POSN                                0x5
#define _DFLTCON_FLT3EN_POSITION                            0x5
#define _DFLTCON_FLT3EN_SIZE                                0x1
#define _DFLTCON_FLT3EN_LENGTH                              0x1
#define _DFLTCON_FLT3EN_MASK                                0x20
#define _DFLTCON_FLT4EN_POSN                                0x6
#define _DFLTCON_FLT4EN_POSITION                            0x6
#define _DFLTCON_FLT4EN_SIZE                                0x1
#define _DFLTCON_FLT4EN_LENGTH                              0x1
#define _DFLTCON_FLT4EN_MASK                                0x40
#define _DFLTCON_FLTCK0_POSN                                0x0
#define _DFLTCON_FLTCK0_POSITION                            0x0
#define _DFLTCON_FLTCK0_SIZE                                0x1
#define _DFLTCON_FLTCK0_LENGTH                              0x1
#define _DFLTCON_FLTCK0_MASK                                0x1
#define _DFLTCON_FLTCK1_POSN                                0x1
#define _DFLTCON_FLTCK1_POSITION                            0x1
#define _DFLTCON_FLTCK1_SIZE                                0x1
#define _DFLTCON_FLTCK1_LENGTH                              0x1
#define _DFLTCON_FLTCK1_MASK                                0x2
#define _DFLTCON_FLTCK2_POSN                                0x2
#define _DFLTCON_FLTCK2_POSITION                            0x2
#define _DFLTCON_FLTCK2_SIZE                                0x1
#define _DFLTCON_FLTCK2_LENGTH                              0x1
#define _DFLTCON_FLTCK2_MASK                                0x4

// Register: CAP3CON
#define CAP3CON CAP3CON
extern volatile unsigned char           CAP3CON             __at(0xF61);
#ifndef _LIB_BUILD
asm("CAP3CON equ 0F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CAP3M                  :4;
        unsigned                        :1;
        unsigned CAP3TMR                :1;
        unsigned CAP3REN                :1;
    };
    struct {
        unsigned CAP3M0                 :1;
        unsigned CAP3M1                 :1;
        unsigned CAP3M2                 :1;
        unsigned CAP3M3                 :1;
    };
} CAP3CONbits_t;
extern volatile CAP3CONbits_t CAP3CONbits __at(0xF61);
// bitfield macros
#define _CAP3CON_CAP3M_POSN                                 0x0
#define _CAP3CON_CAP3M_POSITION                             0x0
#define _CAP3CON_CAP3M_SIZE                                 0x4
#define _CAP3CON_CAP3M_LENGTH                               0x4
#define _CAP3CON_CAP3M_MASK                                 0xF
#define _CAP3CON_CAP3TMR_POSN                               0x5
#define _CAP3CON_CAP3TMR_POSITION                           0x5
#define _CAP3CON_CAP3TMR_SIZE                               0x1
#define _CAP3CON_CAP3TMR_LENGTH                             0x1
#define _CAP3CON_CAP3TMR_MASK                               0x20
#define _CAP3CON_CAP3REN_POSN                               0x6
#define _CAP3CON_CAP3REN_POSITION                           0x6
#define _CAP3CON_CAP3REN_SIZE                               0x1
#define _CAP3CON_CAP3REN_LENGTH                             0x1
#define _CAP3CON_CAP3REN_MASK                               0x40
#define _CAP3CON_CAP3M0_POSN                                0x0
#define _CAP3CON_CAP3M0_POSITION                            0x0
#define _CAP3CON_CAP3M0_SIZE                                0x1
#define _CAP3CON_CAP3M0_LENGTH                              0x1
#define _CAP3CON_CAP3M0_MASK                                0x1
#define _CAP3CON_CAP3M1_POSN                                0x1
#define _CAP3CON_CAP3M1_POSITION                            0x1
#define _CAP3CON_CAP3M1_SIZE                                0x1
#define _CAP3CON_CAP3M1_LENGTH                              0x1
#define _CAP3CON_CAP3M1_MASK                                0x2
#define _CAP3CON_CAP3M2_POSN                                0x2
#define _CAP3CON_CAP3M2_POSITION                            0x2
#define _CAP3CON_CAP3M2_SIZE                                0x1
#define _CAP3CON_CAP3M2_LENGTH                              0x1
#define _CAP3CON_CAP3M2_MASK                                0x4
#define _CAP3CON_CAP3M3_POSN                                0x3
#define _CAP3CON_CAP3M3_POSITION                            0x3
#define _CAP3CON_CAP3M3_SIZE                                0x1
#define _CAP3CON_CAP3M3_LENGTH                              0x1
#define _CAP3CON_CAP3M3_MASK                                0x8

// Register: CAP2CON
#define CAP2CON CAP2CON
extern volatile unsigned char           CAP2CON             __at(0xF62);
#ifndef _LIB_BUILD
asm("CAP2CON equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CAP2M                  :4;
        unsigned                        :1;
        unsigned CAP2TMR                :1;
        unsigned CAP2REN                :1;
    };
    struct {
        unsigned CAP2M0                 :1;
        unsigned CAP2M1                 :1;
        unsigned CAP2M2                 :1;
        unsigned CAP2M3                 :1;
    };
} CAP2CONbits_t;
extern volatile CAP2CONbits_t CAP2CONbits __at(0xF62);
// bitfield macros
#define _CAP2CON_CAP2M_POSN                                 0x0
#define _CAP2CON_CAP2M_POSITION                             0x0
#define _CAP2CON_CAP2M_SIZE                                 0x4
#define _CAP2CON_CAP2M_LENGTH                               0x4
#define _CAP2CON_CAP2M_MASK                                 0xF
#define _CAP2CON_CAP2TMR_POSN                               0x5
#define _CAP2CON_CAP2TMR_POSITION                           0x5
#define _CAP2CON_CAP2TMR_SIZE                               0x1
#define _CAP2CON_CAP2TMR_LENGTH                             0x1
#define _CAP2CON_CAP2TMR_MASK                               0x20
#define _CAP2CON_CAP2REN_POSN                               0x6
#define _CAP2CON_CAP2REN_POSITION                           0x6
#define _CAP2CON_CAP2REN_SIZE                               0x1
#define _CAP2CON_CAP2REN_LENGTH                             0x1
#define _CAP2CON_CAP2REN_MASK                               0x40
#define _CAP2CON_CAP2M0_POSN                                0x0
#define _CAP2CON_CAP2M0_POSITION                            0x0
#define _CAP2CON_CAP2M0_SIZE                                0x1
#define _CAP2CON_CAP2M0_LENGTH                              0x1
#define _CAP2CON_CAP2M0_MASK                                0x1
#define _CAP2CON_CAP2M1_POSN                                0x1
#define _CAP2CON_CAP2M1_POSITION                            0x1
#define _CAP2CON_CAP2M1_SIZE                                0x1
#define _CAP2CON_CAP2M1_LENGTH                              0x1
#define _CAP2CON_CAP2M1_MASK                                0x2
#define _CAP2CON_CAP2M2_POSN                                0x2
#define _CAP2CON_CAP2M2_POSITION                            0x2
#define _CAP2CON_CAP2M2_SIZE                                0x1
#define _CAP2CON_CAP2M2_LENGTH                              0x1
#define _CAP2CON_CAP2M2_MASK                                0x4
#define _CAP2CON_CAP2M3_POSN                                0x3
#define _CAP2CON_CAP2M3_POSITION                            0x3
#define _CAP2CON_CAP2M3_SIZE                                0x1
#define _CAP2CON_CAP2M3_LENGTH                              0x1
#define _CAP2CON_CAP2M3_MASK                                0x8

