MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4331/mcu.h
extern volatile DTCONbits_t DTCONbits __at(0xF6D);
// bitfield macros
#define _DTCON_DTA_POSN                                     0x0
#define _DTCON_DTA_POSITION                                 0x0
#define _DTCON_DTA_SIZE                                     0x6
#define _DTCON_DTA_LENGTH                                   0x6
#define _DTCON_DTA_MASK                                     0x3F
#define _DTCON_DTAPS_POSN                                   0x6
#define _DTCON_DTAPS_POSITION                               0x6
#define _DTCON_DTAPS_SIZE                                   0x2
#define _DTCON_DTAPS_LENGTH                                 0x2
#define _DTCON_DTAPS_MASK                                   0xC0
#define _DTCON_DT0_POSN                                     0x0
#define _DTCON_DT0_POSITION                                 0x0
#define _DTCON_DT0_SIZE                                     0x1
#define _DTCON_DT0_LENGTH                                   0x1
#define _DTCON_DT0_MASK                                     0x1
#define _DTCON_DT1_POSN                                     0x1
#define _DTCON_DT1_POSITION                                 0x1
#define _DTCON_DT1_SIZE                                     0x1
#define _DTCON_DT1_LENGTH                                   0x1
#define _DTCON_DT1_MASK                                     0x2
#define _DTCON_DT2_POSN                                     0x2
#define _DTCON_DT2_POSITION                                 0x2
#define _DTCON_DT2_SIZE                                     0x1
#define _DTCON_DT2_LENGTH                                   0x1
#define _DTCON_DT2_MASK                                     0x4
#define _DTCON_DT3_POSN                                     0x3
#define _DTCON_DT3_POSITION                                 0x3
#define _DTCON_DT3_SIZE                                     0x1
#define _DTCON_DT3_LENGTH                                   0x1
#define _DTCON_DT3_MASK                                     0x8
#define _DTCON_DT4_POSN                                     0x4
#define _DTCON_DT4_POSITION                                 0x4
#define _DTCON_DT4_SIZE                                     0x1
#define _DTCON_DT4_LENGTH                                   0x1
#define _DTCON_DT4_MASK                                     0x10
#define _DTCON_DT5_POSN                                     0x5
#define _DTCON_DT5_POSITION                                 0x5
#define _DTCON_DT5_SIZE                                     0x1
#define _DTCON_DT5_LENGTH                                   0x1
#define _DTCON_DT5_MASK                                     0x20
#define _DTCON_DTPS0_POSN                                   0x6
#define _DTCON_DTPS0_POSITION                               0x6
#define _DTCON_DTPS0_SIZE                                   0x1
#define _DTCON_DTPS0_LENGTH                                 0x1
#define _DTCON_DTPS0_MASK                                   0x40
#define _DTCON_DTPS1_POSN                                   0x7
#define _DTCON_DTPS1_POSITION                               0x7
#define _DTCON_DTPS1_SIZE                                   0x1
#define _DTCON_DTPS1_LENGTH                                 0x1
#define _DTCON_DTPS1_MASK                                   0x80
#define _DTCON_DTA0_POSN                                    0x0
#define _DTCON_DTA0_POSITION                                0x0
#define _DTCON_DTA0_SIZE                                    0x1
#define _DTCON_DTA0_LENGTH                                  0x1
#define _DTCON_DTA0_MASK                                    0x1
#define _DTCON_DTA1_POSN                                    0x1
#define _DTCON_DTA1_POSITION                                0x1
#define _DTCON_DTA1_SIZE                                    0x1
#define _DTCON_DTA1_LENGTH                                  0x1
#define _DTCON_DTA1_MASK                                    0x2
#define _DTCON_DTA2_POSN                                    0x2
#define _DTCON_DTA2_POSITION                                0x2
#define _DTCON_DTA2_SIZE                                    0x1
#define _DTCON_DTA2_LENGTH                                  0x1
#define _DTCON_DTA2_MASK                                    0x4
#define _DTCON_DTA3_POSN                                    0x3
#define _DTCON_DTA3_POSITION                                0x3
#define _DTCON_DTA3_SIZE                                    0x1
#define _DTCON_DTA3_LENGTH                                  0x1
#define _DTCON_DTA3_MASK                                    0x8
#define _DTCON_DTA4_POSN                                    0x4
#define _DTCON_DTA4_POSITION                                0x4
#define _DTCON_DTA4_SIZE                                    0x1
#define _DTCON_DTA4_LENGTH                                  0x1
#define _DTCON_DTA4_MASK                                    0x10
#define _DTCON_DTA5_POSN                                    0x5
#define _DTCON_DTA5_POSITION                                0x5
#define _DTCON_DTA5_SIZE                                    0x1
#define _DTCON_DTA5_LENGTH                                  0x1
#define _DTCON_DTA5_MASK                                    0x20
#define _DTCON_DTAPS0_POSN                                  0x6
#define _DTCON_DTAPS0_POSITION                              0x6
#define _DTCON_DTAPS0_SIZE                                  0x1
#define _DTCON_DTAPS0_LENGTH                                0x1
#define _DTCON_DTAPS0_MASK                                  0x40
#define _DTCON_DTAPS1_POSN                                  0x7
#define _DTCON_DTAPS1_POSITION                              0x7
#define _DTCON_DTAPS1_SIZE                                  0x1
#define _DTCON_DTAPS1_LENGTH                                0x1
#define _DTCON_DTAPS1_MASK                                  0x80

// Register: PWMCON1
#define PWMCON1 PWMCON1
extern volatile unsigned char           PWMCON1             __at(0xF6E);
#ifndef _LIB_BUILD
asm("PWMCON1 equ 0F6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OSYNC                  :1;
        unsigned UDIS                   :1;
        unsigned                        :1;
        unsigned SEVTDIR                :1;
        unsigned SEVOPS                 :4;
    };
    struct {
        unsigned                        :4;
        unsigned SEVOPS0                :1;
        unsigned SEVOPS1                :1;
        unsigned SEVOPS2                :1;
        unsigned SEVOPS3                :1;
    };
} PWMCON1bits_t;
extern volatile PWMCON1bits_t PWMCON1bits __at(0xF6E);
// bitfield macros
#define _PWMCON1_OSYNC_POSN                                 0x0
#define _PWMCON1_OSYNC_POSITION                             0x0
#define _PWMCON1_OSYNC_SIZE                                 0x1
#define _PWMCON1_OSYNC_LENGTH                               0x1
#define _PWMCON1_OSYNC_MASK                                 0x1
#define _PWMCON1_UDIS_POSN                                  0x1
#define _PWMCON1_UDIS_POSITION                              0x1
#define _PWMCON1_UDIS_SIZE                                  0x1
#define _PWMCON1_UDIS_LENGTH                                0x1
#define _PWMCON1_UDIS_MASK                                  0x2
#define _PWMCON1_SEVTDIR_POSN                               0x3
#define _PWMCON1_SEVTDIR_POSITION                           0x3
#define _PWMCON1_SEVTDIR_SIZE                               0x1
#define _PWMCON1_SEVTDIR_LENGTH                             0x1
#define _PWMCON1_SEVTDIR_MASK                               0x8
#define _PWMCON1_SEVOPS_POSN                                0x4
#define _PWMCON1_SEVOPS_POSITION                            0x4
#define _PWMCON1_SEVOPS_SIZE                                0x4
#define _PWMCON1_SEVOPS_LENGTH                              0x4
#define _PWMCON1_SEVOPS_MASK                                0xF0
#define _PWMCON1_SEVOPS0_POSN                               0x4
#define _PWMCON1_SEVOPS0_POSITION                           0x4
#define _PWMCON1_SEVOPS0_SIZE                               0x1
#define _PWMCON1_SEVOPS0_LENGTH                             0x1
#define _PWMCON1_SEVOPS0_MASK                               0x10
#define _PWMCON1_SEVOPS1_POSN                               0x5
#define _PWMCON1_SEVOPS1_POSITION                           0x5
#define _PWMCON1_SEVOPS1_SIZE                               0x1
#define _PWMCON1_SEVOPS1_LENGTH                             0x1
#define _PWMCON1_SEVOPS1_MASK                               0x20
#define _PWMCON1_SEVOPS2_POSN                               0x6
#define _PWMCON1_SEVOPS2_POSITION                           0x6
#define _PWMCON1_SEVOPS2_SIZE                               0x1
#define _PWMCON1_SEVOPS2_LENGTH                             0x1
#define _PWMCON1_SEVOPS2_MASK                               0x40
#define _PWMCON1_SEVOPS3_POSN                               0x7
#define _PWMCON1_SEVOPS3_POSITION                           0x7
#define _PWMCON1_SEVOPS3_SIZE                               0x1
#define _PWMCON1_SEVOPS3_LENGTH                             0x1
#define _PWMCON1_SEVOPS3_MASK                               0x80

// Register: PWMCON0
#define PWMCON0 PWMCON0
extern volatile unsigned char           PWMCON0             __at(0xF6F);
#ifndef _LIB_BUILD
asm("PWMCON0 equ 0F6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMOD                   :4;
        unsigned PWMEN                  :3;
    };
    struct {
        unsigned PMOD0                  :1;
        unsigned PMOD1                  :1;
        unsigned PMOD2                  :1;
        unsigned PMOD3                  :1;
        unsigned PWMEN0                 :1;
        unsigned PWMEN1                 :1;
        unsigned PWMEN2                 :1;
    };
} PWMCON0bits_t;
extern volatile PWMCON0bits_t PWMCON0bits __at(0xF6F);
// bitfield macros
#define _PWMCON0_PMOD_POSN                                  0x0
#define _PWMCON0_PMOD_POSITION                              0x0
#define _PWMCON0_PMOD_SIZE                                  0x4
#define _PWMCON0_PMOD_LENGTH                                0x4
#define _PWMCON0_PMOD_MASK                                  0xF
#define _PWMCON0_PWMEN_POSN                                 0x4
#define _PWMCON0_PWMEN_POSITION                             0x4
#define _PWMCON0_PWMEN_SIZE                                 0x3
#define _PWMCON0_PWMEN_LENGTH                               0x3
#define _PWMCON0_PWMEN_MASK                                 0x70
#define _PWMCON0_PMOD0_POSN                                 0x0
#define _PWMCON0_PMOD0_POSITION                             0x0
#define _PWMCON0_PMOD0_SIZE                                 0x1
#define _PWMCON0_PMOD0_LENGTH                               0x1
#define _PWMCON0_PMOD0_MASK                                 0x1
#define _PWMCON0_PMOD1_POSN                                 0x1
#define _PWMCON0_PMOD1_POSITION                             0x1
#define _PWMCON0_PMOD1_SIZE                                 0x1
#define _PWMCON0_PMOD1_LENGTH                               0x1
#define _PWMCON0_PMOD1_MASK                                 0x2
#define _PWMCON0_PMOD2_POSN                                 0x2
#define _PWMCON0_PMOD2_POSITION                             0x2
#define _PWMCON0_PMOD2_SIZE                                 0x1
#define _PWMCON0_PMOD2_LENGTH                               0x1
#define _PWMCON0_PMOD2_MASK                                 0x4
#define _PWMCON0_PMOD3_POSN                                 0x3
#define _PWMCON0_PMOD3_POSITION                             0x3
#define _PWMCON0_PMOD3_SIZE                                 0x1
#define _PWMCON0_PMOD3_LENGTH                               0x1
#define _PWMCON0_PMOD3_MASK                                 0x8
#define _PWMCON0_PWMEN0_POSN                                0x4
#define _PWMCON0_PWMEN0_POSITION                            0x4
#define _PWMCON0_PWMEN0_SIZE                                0x1
#define _PWMCON0_PWMEN0_LENGTH                              0x1
#define _PWMCON0_PWMEN0_MASK                                0x10
#define _PWMCON0_PWMEN1_POSN                                0x5
#define _PWMCON0_PWMEN1_POSITION                            0x5
#define _PWMCON0_PWMEN1_SIZE                                0x1
#define _PWMCON0_PWMEN1_LENGTH                              0x1
#define _PWMCON0_PWMEN1_MASK                                0x20
#define _PWMCON0_PWMEN2_POSN                                0x6
#define _PWMCON0_PWMEN2_POSITION                            0x6
#define _PWMCON0_PWMEN2_SIZE                                0x1
#define _PWMCON0_PWMEN2_LENGTH                              0x1
#define _PWMCON0_PWMEN2_MASK                                0x40

