MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4331/mcu.h
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// TXSTA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA,7)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// QEICON<DOWN>
extern volatile __bit                   DOWN                __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 DOWN_bit            _BIT_ACCESS(QEICON,5)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// DTCON<DT0>
extern volatile __bit                   DT0                 __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 DT0_bit             _BIT_ACCESS(DTCON,0)
// DTCON<DT1>
extern volatile __bit                   DT1                 __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 DT1_bit             _BIT_ACCESS(DTCON,1)
// DTCON<DT2>
extern volatile __bit                   DT2                 __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 DT2_bit             _BIT_ACCESS(DTCON,2)
// DTCON<DT3>
extern volatile __bit                   DT3                 __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 DT3_bit             _BIT_ACCESS(DTCON,3)
// DTCON<DT4>
extern volatile __bit                   DT4                 __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 DT4_bit             _BIT_ACCESS(DTCON,4)
// DTCON<DT5>
extern volatile __bit                   DT5                 __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DT5_bit             _BIT_ACCESS(DTCON,5)
// DTCON<DTA0>
extern volatile __bit                   DTA0                __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 DTA0_bit            _BIT_ACCESS(DTCON,0)
// DTCON<DTA1>
extern volatile __bit                   DTA1                __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 DTA1_bit            _BIT_ACCESS(DTCON,1)
// DTCON<DTA2>
extern volatile __bit                   DTA2                __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 DTA2_bit            _BIT_ACCESS(DTCON,2)
// DTCON<DTA3>
extern volatile __bit                   DTA3                __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 DTA3_bit            _BIT_ACCESS(DTCON,3)
// DTCON<DTA4>
extern volatile __bit                   DTA4                __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 DTA4_bit            _BIT_ACCESS(DTCON,4)
// DTCON<DTA5>
extern volatile __bit                   DTA5                __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DTA5_bit            _BIT_ACCESS(DTCON,5)
// DTCON<DTAPS0>
extern volatile __bit                   DTAPS0              __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 DTAPS0_bit          _BIT_ACCESS(DTCON,6)
// DTCON<DTAPS1>
extern volatile __bit                   DTAPS1              __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 DTAPS1_bit          _BIT_ACCESS(DTCON,7)
// DTCON<DTPS0>
extern volatile __bit                   DTPS0               __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 DTPS0_bit           _BIT_ACCESS(DTCON,6)
// DTCON<DTPS1>
extern volatile __bit                   DTPS1               __at(0x7B6F);	// @ (0xF6D * 8 + 7)
#define                                 DTPS1_bit           _BIT_ACCESS(DTCON,7)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// IPR2<EEIP>
extern volatile __bit                   EEIP                __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 EEIP_bit            _BIT_ACCESS(IPR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// QEICON<ERROR>
extern volatile __bit                   ERROR               __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 ERROR_bit           _BIT_ACCESS(QEICON,6)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// ADCON1<FFOVFL>
extern volatile __bit                   FFOVFL              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 FFOVFL_bit          _BIT_ACCESS(ADCON1,2)
// ADCON1<FIFOEN>
extern volatile __bit                   FIFOEN              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 FIFOEN_bit          _BIT_ACCESS(ADCON1,4)
// DFLTCON<FLT1EN>
extern volatile __bit                   FLT1EN              __at(0x7B03);	// @ (0xF60 * 8 + 3)
#define                                 FLT1EN_bit          _BIT_ACCESS(DFLTCON,3)
// DFLTCON<FLT2EN>
extern volatile __bit                   FLT2EN              __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 FLT2EN_bit          _BIT_ACCESS(DFLTCON,4)
// DFLTCON<FLT3EN>
extern volatile __bit                   FLT3EN              __at(0x7B05);	// @ (0xF60 * 8 + 5)
#define                                 FLT3EN_bit          _BIT_ACCESS(DFLTCON,5)
// DFLTCON<FLT4EN>
extern volatile __bit                   FLT4EN              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 FLT4EN_bit          _BIT_ACCESS(DFLTCON,6)
// PORTC<FLTA>
extern volatile __bit                   FLTA                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 FLTA_bit            _BIT_ACCESS(PORTC,1)
// FLTCONFIG<FLTAEN>
extern volatile __bit                   FLTAEN              __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 FLTAEN_bit          _BIT_ACCESS(FLTCONFIG,0)
// FLTCONFIG<FLTAMOD>
extern volatile __bit                   FLTAMOD             __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 FLTAMOD_bit         _BIT_ACCESS(FLTCONFIG,1)
// FLTCONFIG<FLTAS>
extern volatile __bit                   FLTAS               __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 FLTAS_bit           _BIT_ACCESS(FLTCONFIG,2)
// PORTC<FLTB>
extern volatile __bit                   FLTB                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 FLTB_bit            _BIT_ACCESS(PORTC,2)
// FLTCONFIG<FLTBEN>
extern volatile __bit                   FLTBEN              __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 FLTBEN_bit          _BIT_ACCESS(FLTCONFIG,4)
// FLTCONFIG<FLTBMOD>
extern volatile __bit                   FLTBMOD             __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 FLTBMOD_bit         _BIT_ACCESS(FLTCONFIG,5)
// FLTCONFIG<FLTBS>
extern volatile __bit                   FLTBS               __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 FLTBS_bit           _BIT_ACCESS(FLTCONFIG,6)
// DFLTCON<FLTCK0>
extern volatile __bit                   FLTCK0              __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 FLTCK0_bit          _BIT_ACCESS(DFLTCON,0)
// DFLTCON<FLTCK1>
extern volatile __bit                   FLTCK1              __at(0x7B01);	// @ (0xF60 * 8 + 1)
#define                                 FLTCK1_bit          _BIT_ACCESS(DFLTCON,1)
// DFLTCON<FLTCK2>
extern volatile __bit                   FLTCK2              __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 FLTCK2_bit          _BIT_ACCESS(DFLTCON,2)
// FLTCONFIG<FLTCON>
extern volatile __bit                   FLTCON              __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 FLTCON_bit          _BIT_ACCESS(FLTCONFIG,3)
// OSCCON<FLTS>
extern volatile __bit                   FLTS                __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 FLTS_bit            _BIT_ACCESS(OSCCON,2)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// ADCHS<GASEL0>
extern volatile __bit                   GASEL0              __at(0x7CC8);	// @ (0xF99 * 8 + 0)
#define                                 GASEL0_bit          _BIT_ACCESS(ADCHS,0)
// ADCHS<GASEL1>
extern volatile __bit                   GASEL1              __at(0x7CC9);	// @ (0xF99 * 8 + 1)
#define                                 GASEL1_bit          _BIT_ACCESS(ADCHS,1)
// ADCHS<GBSEL0>
extern volatile __bit                   GBSEL0              __at(0x7CCC);	// @ (0xF99 * 8 + 4)
#define                                 GBSEL0_bit          _BIT_ACCESS(ADCHS,4)
// ADCHS<GBSEL1>
extern volatile __bit                   GBSEL1              __at(0x7CCD);	// @ (0xF99 * 8 + 5)
#define                                 GBSEL1_bit          _BIT_ACCESS(ADCHS,5)
// ADCHS<GCSEL0>
extern volatile __bit                   GCSEL0              __at(0x7CCA);	// @ (0xF99 * 8 + 2)
#define                                 GCSEL0_bit          _BIT_ACCESS(ADCHS,2)
// ADCHS<GCSEL1>
extern volatile __bit                   GCSEL1              __at(0x7CCB);	// @ (0xF99 * 8 + 3)
#define                                 GCSEL1_bit          _BIT_ACCESS(ADCHS,3)
// ADCHS<GDSEL0>
extern volatile __bit                   GDSEL0              __at(0x7CCE);	// @ (0xF99 * 8 + 6)
#define                                 GDSEL0_bit          _BIT_ACCESS(ADCHS,6)
// ADCHS<GDSEL1>
extern volatile __bit                   GDSEL1              __at(0x7CCF);	// @ (0xF99 * 8 + 7)
#define                                 GDSEL1_bit          _BIT_ACCESS(ADCHS,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GODONE>
extern volatile __bit                   GODONE              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GODONE_bit          _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// PIE3<IC1IE>
extern volatile __bit                   IC1IE               __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 IC1IE_bit           _BIT_ACCESS(PIE3,1)
// PIR3<IC1IF>
extern volatile __bit                   IC1IF               __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 IC1IF_bit           _BIT_ACCESS(PIR3,1)
// IPR3<IC1IP>
extern volatile __bit                   IC1IP               __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 IC1IP_bit           _BIT_ACCESS(IPR3,1)
// PIE3<IC2QEIE>
extern volatile __bit                   IC2QEIE             __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 IC2QEIE_bit         _BIT_ACCESS(PIE3,2)
// PIR3<IC2QEIF>
extern volatile __bit                   IC2QEIF             __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 IC2QEIF_bit         _BIT_ACCESS(PIR3,2)
// IPR3<IC2QEIP>
extern volatile __bit                   IC2QEIP             __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 IC2QEIP_bit         _BIT_ACCESS(IPR3,2)
// PIE3<IC3DRIE>
extern volatile __bit                   IC3DRIE             __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 IC3DRIE_bit         _BIT_ACCESS(PIE3,3)
// PIR3<IC3DRIF>
extern volatile __bit                   IC3DRIF             __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 IC3DRIF_bit         _BIT_ACCESS(PIR3,3)
// IPR3<IC3DRIP>
extern volatile __bit                   IC3DRIP             __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 IC3DRIP_bit         _BIT_ACCESS(IPR3,3)
// OSCCON<IDLEN>
extern volatile __bit                   IDLEN               __at(0x7E9F);	// @ (0xFD3 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(OSCCON,7)
// PORTC<INT0>
extern volatile __bit                   INT0                __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 INT0_bit            _BIT_ACCESS(PORTC,3)
// INTCON<INT0E>
extern volatile __bit                   INT0E               __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0E_bit           _BIT_ACCESS(INTCON,4)
// INTCON<INT0F>
extern volatile __bit                   INT0F               __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0F_bit           _BIT_ACCESS(INTCON,1)
// INTCON<INT0IE>
extern volatile __bit                   INT0IE              __at(0x7F94);	// @ (0xFF2 * 8 + 4)
#define                                 INT0IE_bit          _BIT_ACCESS(INTCON,4)
// INTCON<INT0IF>
extern volatile __bit                   INT0IF              __at(0x7F91);	// @ (0xFF2 * 8 + 1)
#define                                 INT0IF_bit          _BIT_ACCESS(INTCON,1)
// PORTC<INT1>
extern volatile __bit                   INT1                __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 INT1_bit            _BIT_ACCESS(PORTC,4)
// INTCON3<INT1E>
extern volatile __bit                   INT1E               __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1E_bit           _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1F>
extern volatile __bit                   INT1F               __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1F_bit           _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IE>
extern volatile __bit                   INT1IE              __at(0x7F83);	// @ (0xFF0 * 8 + 3)
#define                                 INT1IE_bit          _BIT_ACCESS(INTCON3,3)
// INTCON3<INT1IF>
extern volatile __bit                   INT1IF              __at(0x7F80);	// @ (0xFF0 * 8 + 0)
#define                                 INT1IF_bit          _BIT_ACCESS(INTCON3,0)
// INTCON3<INT1IP>
extern volatile __bit                   INT1IP              __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1IP_bit          _BIT_ACCESS(INTCON3,6)
// INTCON3<INT1P>
extern volatile __bit                   INT1P               __at(0x7F86);	// @ (0xFF0 * 8 + 6)
#define                                 INT1P_bit           _BIT_ACCESS(INTCON3,6)
// PORTC<INT2>
extern volatile __bit                   INT2                __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 INT2_bit            _BIT_ACCESS(PORTC,5)
// INTCON3<INT2E>
extern volatile __bit                   INT2E               __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2E_bit           _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2F>
extern volatile __bit                   INT2F               __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2F_bit           _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IE>
extern volatile __bit                   INT2IE              __at(0x7F84);	// @ (0xFF0 * 8 + 4)
#define                                 INT2IE_bit          _BIT_ACCESS(INTCON3,4)
// INTCON3<INT2IF>
extern volatile __bit                   INT2IF              __at(0x7F81);	// @ (0xFF0 * 8 + 1)
#define                                 INT2IF_bit          _BIT_ACCESS(INTCON3,1)
// INTCON3<INT2IP>
extern volatile __bit                   INT2IP              __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2IP_bit          _BIT_ACCESS(INTCON3,7)
// INTCON3<INT2P>
extern volatile __bit                   INT2P               __at(0x7F87);	// @ (0xFF0 * 8 + 7)
#define                                 INT2P_bit           _BIT_ACCESS(INTCON3,7)
// INTCON2<INTEDG0>
extern volatile __bit                   INTEDG0             __at(0x7F8E);	// @ (0xFF1 * 8 + 6)
#define                                 INTEDG0_bit         _BIT_ACCESS(INTCON2,6)
// INTCON2<INTEDG1>
extern volatile __bit                   INTEDG1             __at(0x7F8D);	// @ (0xFF1 * 8 + 5)
#define                                 INTEDG1_bit         _BIT_ACCESS(INTCON2,5)
// INTCON2<INTEDG2>
extern volatile __bit                   INTEDG2             __at(0x7F8C);	// @ (0xFF1 * 8 + 4)
#define                                 INTEDG2_bit         _BIT_ACCESS(INTCON2,4)
// OSCCON<IOFS>
extern volatile __bit                   IOFS                __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 IOFS_bit            _BIT_ACCESS(OSCCON,2)
// RCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 IPEN_bit            _BIT_ACCESS(RCON,7)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x7E9C);	// @ (0xFD3 * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x7E9D);	// @ (0xFD3 * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x7E9E);	// @ (0xFD3 * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// LVDCON<IRVST>
extern volatile __bit                   IRVST               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 IRVST_bit           _BIT_ACCESS(LVDCON,5)
// LVDCON<IVRST>
extern volatile __bit                   IVRST               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 IVRST_bit           _BIT_ACCESS(LVDCON,5)
// LATA<LA0>
extern volatile __bit                   LA0                 __at(0x7C48);	// @ (0xF89 * 8 + 0)
#define                                 LA0_bit             _BIT_ACCESS(LATA,0)
// LATA<LA1>
extern volatile __bit                   LA1                 __at(0x7C49);	// @ (0xF89 * 8 + 1)
#define                                 LA1_bit             _BIT_ACCESS(LATA,1)
// LATA<LA2>
extern volatile __bit                   LA2                 __at(0x7C4A);	// @ (0xF89 * 8 + 2)
#define                                 LA2_bit             _BIT_ACCESS(LATA,2)
// LATA<LA3>
extern volatile __bit                   LA3                 __at(0x7C4B);	// @ (0xF89 * 8 + 3)
#define                                 LA3_bit             _BIT_ACCESS(LATA,3)
// LATA<LA4>
extern volatile __bit                   LA4                 __at(0x7C4C);	// @ (0xF89 * 8 + 4)
#define                                 LA4_bit             _BIT_ACCESS(LATA,4)
// LATA<LA5>
extern volatile __bit                   LA5                 __at(0x7C4D);	// @ (0xF89 * 8 + 5)
#define                                 LA5_bit             _BIT_ACCESS(LATA,5)
// LATA<LA6>
extern volatile __bit                   LA6                 __at(0x7C4E);	// @ (0xF89 * 8 + 6)
#define                                 LA6_bit             _BIT_ACCESS(LATA,6)
// LATA<LA7>
extern volatile __bit                   LA7                 __at(0x7C4F);	// @ (0xF89 * 8 + 7)
