MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4331/mcu.h
extern volatile __bit                   POUT4               __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 POUT4_bit           _BIT_ACCESS(OVDCONS,4)
// OVDCONS<POUT5>
extern volatile __bit                   POUT5               __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 POUT5_bit           _BIT_ACCESS(OVDCONS,5)
// OVDCONS<POUT6>
extern volatile __bit                   POUT6               __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 POUT6_bit           _BIT_ACCESS(OVDCONS,6)
// OVDCONS<POUT7>
extern volatile __bit                   POUT7               __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 POUT7_bit           _BIT_ACCESS(OVDCONS,7)
// OVDCOND<POVD0>
extern volatile __bit                   POVD0               __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 POVD0_bit           _BIT_ACCESS(OVDCOND,0)
// OVDCOND<POVD1>
extern volatile __bit                   POVD1               __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 POVD1_bit           _BIT_ACCESS(OVDCOND,1)
// OVDCOND<POVD2>
extern volatile __bit                   POVD2               __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 POVD2_bit           _BIT_ACCESS(OVDCOND,2)
// OVDCOND<POVD3>
extern volatile __bit                   POVD3               __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 POVD3_bit           _BIT_ACCESS(OVDCOND,3)
// OVDCOND<POVD4>
extern volatile __bit                   POVD4               __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 POVD4_bit           _BIT_ACCESS(OVDCOND,4)
// OVDCOND<POVD5>
extern volatile __bit                   POVD5               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 POVD5_bit           _BIT_ACCESS(OVDCOND,5)
// OVDCOND<POVD6>
extern volatile __bit                   POVD6               __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 POVD6_bit           _BIT_ACCESS(OVDCOND,6)
// OVDCOND<POVD7>
extern volatile __bit                   POVD7               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 POVD7_bit           _BIT_ACCESS(OVDCOND,7)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PTCON0<PTCKPS0>
extern volatile __bit                   PTCKPS0             __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 PTCKPS0_bit         _BIT_ACCESS(PTCON0,2)
// PTCON0<PTCKPS1>
extern volatile __bit                   PTCKPS1             __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 PTCKPS1_bit         _BIT_ACCESS(PTCON0,3)
// PTCON1<PTDIR>
extern volatile __bit                   PTDIR               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 PTDIR_bit           _BIT_ACCESS(PTCON1,6)
// PTCON1<PTEN>
extern volatile __bit                   PTEN                __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 PTEN_bit            _BIT_ACCESS(PTCON1,7)
// PIE3<PTIE>
extern volatile __bit                   PTIE                __at(0x7D1C);	// @ (0xFA3 * 8 + 4)
#define                                 PTIE_bit            _BIT_ACCESS(PIE3,4)
// PIR3<PTIF>
extern volatile __bit                   PTIF                __at(0x7D24);	// @ (0xFA4 * 8 + 4)
#define                                 PTIF_bit            _BIT_ACCESS(PIR3,4)
// IPR3<PTIP>
extern volatile __bit                   PTIP                __at(0x7D2C);	// @ (0xFA5 * 8 + 4)
#define                                 PTIP_bit            _BIT_ACCESS(IPR3,4)
// PTCON0<PTMOD0>
extern volatile __bit                   PTMOD0              __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 PTMOD0_bit          _BIT_ACCESS(PTCON0,0)
// PTCON0<PTMOD1>
extern volatile __bit                   PTMOD1              __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 PTMOD1_bit          _BIT_ACCESS(PTCON0,1)
// PTCON0<PTOPS0>
extern volatile __bit                   PTOPS0              __at(0x7BFC);	// @ (0xF7F * 8 + 4)
#define                                 PTOPS0_bit          _BIT_ACCESS(PTCON0,4)
// PTCON0<PTOPS1>
extern volatile __bit                   PTOPS1              __at(0x7BFD);	// @ (0xF7F * 8 + 5)
#define                                 PTOPS1_bit          _BIT_ACCESS(PTCON0,5)
// PTCON0<PTOPS2>
extern volatile __bit                   PTOPS2              __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 PTOPS2_bit          _BIT_ACCESS(PTCON0,6)
// PTCON0<PTOPS3>
extern volatile __bit                   PTOPS3              __at(0x7BFF);	// @ (0xF7F * 8 + 7)
#define                                 PTOPS3_bit          _BIT_ACCESS(PTCON0,7)
// PWMCON0<PWMEN0>
extern volatile __bit                   PWMEN0              __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 PWMEN0_bit          _BIT_ACCESS(PWMCON0,4)
// PWMCON0<PWMEN1>
extern volatile __bit                   PWMEN1              __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 PWMEN1_bit          _BIT_ACCESS(PWMCON0,5)
// PWMCON0<PWMEN2>
extern volatile __bit                   PWMEN2              __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 PWMEN2_bit          _BIT_ACCESS(PWMCON0,6)
// QEICON<QEIM0>
extern volatile __bit                   QEIM0               __at(0x7DB2);	// @ (0xFB6 * 8 + 2)
#define                                 QEIM0_bit           _BIT_ACCESS(QEICON,2)
// QEICON<QEIM1>
extern volatile __bit                   QEIM1               __at(0x7DB3);	// @ (0xFB6 * 8 + 3)
#define                                 QEIM1_bit           _BIT_ACCESS(QEICON,3)
// QEICON<QEIM2>
extern volatile __bit                   QEIM2               __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 QEIM2_bit           _BIT_ACCESS(QEICON,4)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// RCSTA<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA,6)
// RCSTA<RC9>
extern volatile __bit                   RC9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RCD8>
extern volatile __bit                   RCD8                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA,0)
// BAUDCON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x7D56);	// @ (0xFAA * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// IPR1<RCIP>
extern volatile __bit                   RCIP                __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RCIP_bit            _BIT_ACCESS(IPR1,5)
// BAUDCON<RCMT>
extern volatile __bit                   RCMT                __at(0x7D56);	// @ (0xFAA * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON,6)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0x7D30);	// @ (0xFA6 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// T1CON<RD16>
extern volatile __bit                   RD16                __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,7)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSPSTAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSPSTAT,2)
// T5CON<RESEN>
extern volatile __bit                   RESEN               __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 RESEN_bit           _BIT_ACCESS(T5CON,6)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PORTA<RJPU>
extern volatile __bit                   RJPU                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RJPU_bit            _BIT_ACCESS(PORTA,7)
// SSPSTAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSPSTAT,2)
// PORTC<RX>
extern volatile __bit                   RX                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX_bit              _BIT_ACCESS(PORTC,7)
// RCSTA<RX9>
extern volatile __bit                   RX9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RCSTA,6)
// RCSTA<RX9D>
extern volatile __bit                   RX9D                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RCSTA,0)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7D55);	// @ (0xFAA * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON,5)
// BAUDCON<RXDTP>
extern volatile __bit                   RXDTP               __at(0x7D55);	// @ (0xFAA * 8 + 5)
#define                                 RXDTP_bit           _BIT_ACCESS(BAUDCON,5)
// SSPSTAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// ADCHS<SASEL0>
extern volatile __bit                   SASEL0              __at(0x7CC8);	// @ (0xF99 * 8 + 0)
#define                                 SASEL0_bit          _BIT_ACCESS(ADCHS,0)
// ADCHS<SASEL1>
extern volatile __bit                   SASEL1              __at(0x7CC9);	// @ (0xF99 * 8 + 1)
#define                                 SASEL1_bit          _BIT_ACCESS(ADCHS,1)
// ADCHS<SBSEL0>
extern volatile __bit                   SBSEL0              __at(0x7CCC);	// @ (0xF99 * 8 + 4)
#define                                 SBSEL0_bit          _BIT_ACCESS(ADCHS,4)
// ADCHS<SBSEL1>
extern volatile __bit                   SBSEL1              __at(0x7CCD);	// @ (0xF99 * 8 + 5)
#define                                 SBSEL1_bit          _BIT_ACCESS(ADCHS,5)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,5)
// BAUDCON<SCKP>
extern volatile __bit                   SCKP                __at(0x7D54);	// @ (0xFAA * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON,4)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,5)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// ADCHS<SCSEL0>
extern volatile __bit                   SCSEL0              __at(0x7CCA);	// @ (0xF99 * 8 + 2)
#define                                 SCSEL0_bit          _BIT_ACCESS(ADCHS,2)
// ADCHS<SCSEL1>
extern volatile __bit                   SCSEL1              __at(0x7CCB);	// @ (0xF99 * 8 + 3)
#define                                 SCSEL1_bit          _BIT_ACCESS(ADCHS,3)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,7)
// ADCHS<SDSEL0>
extern volatile __bit                   SDSEL0              __at(0x7CCE);	// @ (0xF99 * 8 + 6)
#define                                 SDSEL0_bit          _BIT_ACCESS(ADCHS,6)
// ADCHS<SDSEL1>
extern volatile __bit                   SDSEL1              __at(0x7CCF);	// @ (0xF99 * 8 + 7)
#define                                 SDSEL1_bit          _BIT_ACCESS(ADCHS,7)
// TXSTA<SENDB>
extern volatile __bit                   SENDB               __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TXSTA,3)
// TXSTA<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA,3)
// PWMCON1<SEVOPS0>
extern volatile __bit                   SEVOPS0             __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 SEVOPS0_bit         _BIT_ACCESS(PWMCON1,4)
// PWMCON1<SEVOPS1>
extern volatile __bit                   SEVOPS1             __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 SEVOPS1_bit         _BIT_ACCESS(PWMCON1,5)
// PWMCON1<SEVOPS2>
extern volatile __bit                   SEVOPS2             __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 SEVOPS2_bit         _BIT_ACCESS(PWMCON1,6)
// PWMCON1<SEVOPS3>
extern volatile __bit                   SEVOPS3             __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 SEVOPS3_bit         _BIT_ACCESS(PWMCON1,7)
// PWMCON1<SEVTDIR>
extern volatile __bit                   SEVTDIR             __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 SEVTDIR_bit         _BIT_ACCESS(PWMCON1,3)
// SSPSTAT<SMP>
extern volatile __bit                   SMP                 __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSPSTAT,7)
// T1CON<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(T1CON,3)
// T5CON<SOSCEN5>
extern volatile __bit                   SOSCEN5             __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 SOSCEN5_bit         _BIT_ACCESS(T5CON,3)
// RCSTA<SPEN>
extern volatile __bit                   SPEN                __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RCSTA,7)
// RCSTA<SREN>
extern volatile __bit                   SREN                __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RCSTA,5)
// RCSTA<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA,5)
// PORTC<SS>
extern volatile __bit                   SS                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 SS_bit              _BIT_ACCESS(PORTC,6)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// SSPCON<SSPEN>
extern volatile __bit                   SSPEN               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSPCON,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<SSPIP>
extern volatile __bit                   SSPIP               __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR1,3)
// SSPCON<SSPM0>
extern volatile __bit                   SSPM0               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSPCON,0)
// SSPCON<SSPM1>
extern volatile __bit                   SSPM1               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSPCON,1)
// SSPCON<SSPM2>
extern volatile __bit                   SSPM2               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSPCON,2)
// SSPCON<SSPM3>
extern volatile __bit                   SSPM3               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSPCON,3)
// SSPCON<SSPOV>
extern volatile __bit                   SSPOV               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSPCON,6)
// ADCON3<SSRC0>
extern volatile __bit                   SSRC0               __at(0x7CD0);	// @ (0xF9A * 8 + 0)
#define                                 SSRC0_bit           _BIT_ACCESS(ADCON3,0)
// ADCON3<SSRC1>
extern volatile __bit                   SSRC1               __at(0x7CD1);	// @ (0xF9A * 8 + 1)
#define                                 SSRC1_bit           _BIT_ACCESS(ADCON3,1)
// ADCON3<SSRC2>
extern volatile __bit                   SSRC2               __at(0x7CD2);	// @ (0xF9A * 8 + 2)
#define                                 SSRC2_bit           _BIT_ACCESS(ADCON3,2)
// ADCON3<SSRC3>
extern volatile __bit                   SSRC3               __at(0x7CD3);	// @ (0xF9A * 8 + 3)
#define                                 SSRC3_bit           _BIT_ACCESS(ADCON3,3)
// ADCON3<SSRC4>
extern volatile __bit                   SSRC4               __at(0x7CD4);	// @ (0xF9A * 8 + 4)
#define                                 SSRC4_bit           _BIT_ACCESS(ADCON3,4)
// SSPSTAT<START>
extern volatile __bit                   START               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSPSTAT,3)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSPSTAT<STOP>
