MikroElektronika/core_packages/PIC/XC8/def/PIC18LF4331/mcu.h
#define                                 TXEN1_bit           _BIT_ACCESS(TXSTA,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// SSPSTAT<UA>
extern volatile __bit                   UA                  __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSPSTAT,1)
// PWMCON1<UDIS>
extern volatile __bit                   UDIS                __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 UDIS_bit            _BIT_ACCESS(PWMCON1,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// QEICON<UP>
extern volatile __bit                   UP                  __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 UP_bit              _BIT_ACCESS(QEICON,5)
// QEICON<UPDOWN>
extern volatile __bit                   UPDOWN              __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 UPDOWN_bit          _BIT_ACCESS(QEICON,5)
// QEICON<UP_DOWN>
extern volatile __bit                   UP_DOWN             __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 UP_DOWN_bit         _BIT_ACCESS(QEICON,5)
// QEICON<UP_NOT_DOWN>
extern volatile __bit                   UP_NOT_DOWN         __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 UP_NOT_DOWN_bit     _BIT_ACCESS(QEICON,5)
// QEICON<UP_nDOWN>
extern volatile __bit                   UP_nDOWN            __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 UP_nDOWN_bit        _BIT_ACCESS(QEICON,5)
// ADCON1<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON1,6)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON1,7)
// QEICON<VELM>
extern volatile __bit                   VELM                __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 VELM_bit            _BIT_ACCESS(QEICON,7)
// PORTA<VREFM>
extern volatile __bit                   VREFM               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 VREFM_bit           _BIT_ACCESS(PORTA,2)
// PORTA<VREFP>
extern volatile __bit                   VREFP               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 VREFP_bit           _BIT_ACCESS(PORTA,3)
// BAUDCON<W4E>
extern volatile __bit                   W4E                 __at(0x7D51);	// @ (0xFAA * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUDCON,1)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(_PR2,4)  // Note: Changed by MikroE
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(_PR2,5)  // Note: Changed by MikroE
// SSPCON<WCOL>
extern volatile __bit                   WCOL                __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSPCON,7)
// WDTCON<WDTW>
extern volatile __bit                   WDTW                __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 WDTW_bit            _BIT_ACCESS(WDTCON,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(_PR2,0)  // Note: Changed by MikroE
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(_PR2,1)  // Note: Changed by MikroE
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x7D31);	// @ (0xFA6 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7D32);	// @ (0xFA6 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7D33);	// @ (0xFA6 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// BAUDCON<WUE>
extern volatile __bit                   WUE                 __at(0x7D51);	// @ (0xFAA * 8 + 1)
#define                                 WUE_bit             _BIT_ACCESS(BAUDCON,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSPSTAT<nA>
extern volatile __bit                   nA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<nADDRESS>
extern volatile __bit                   nADDRESS            __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS_bit        _BIT_ACCESS(SSPSTAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// QEICON<nDOWN>
extern volatile __bit                   nDOWN               __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 nDOWN_bit           _BIT_ACCESS(QEICON,5)
// PORTC<nFLTA>
extern volatile __bit                   nFLTA               __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 nFLTA_bit           _BIT_ACCESS(PORTC,1)
// PORTC<nFLTB>
extern volatile __bit                   nFLTB               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 nFLTB_bit           _BIT_ACCESS(PORTC,2)
// RCON<nIPEN>
extern volatile __bit                   nIPEN               __at(0x7E87);	// @ (0xFD0 * 8 + 7)
#define                                 nIPEN_bit           _BIT_ACCESS(RCON,7)
// PORTE<nMCLR>
extern volatile __bit                   nMCLR               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 nMCLR_bit           _BIT_ACCESS(PORTE,3)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// T5CON<nRESEN>
extern volatile __bit                   nRESEN              __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 nRESEN_bit          _BIT_ACCESS(T5CON,6)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// PORTC<nSS>
extern volatile __bit                   nSS                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 nSS_bit             _BIT_ACCESS(PORTC,6)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// QEICON<nVELM>
extern volatile __bit                   nVELM               __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 nVELM_bit           _BIT_ACCESS(QEICON,7)
// SSPSTAT<nW>
extern volatile __bit                   nW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nW_bit              _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<nWRITE>
extern volatile __bit                   nWRITE              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nWRITE_bit          _BIT_ACCESS(SSPSTAT,2)

#endif // _PIC18LF4331_H_
